Repository: umar221b/attendancerecord-xblock
Catalog: attendancerecord/translations/LC_MESSAGES/*/text.po
Languages: ar

source: Attendance Record
ar: سجل الحضور

source: Sessions in this record
ar: الجلسات في هذا السجل

source: Options to choose from for each learner
ar: خيارات الحضور لكل جلسة

source: All learners' records
ar: سجل المتعلمين

source: You must have at least one option to be able to save the learner records.
ar: يجب أن يكون هناك خيار حضور واحد على الأقل حتى تتمكن من حفظ سجل الحضور.

source: You must submit values for the learner records.
ar: يجب أن تختار خيارات حضور للمتعلمين حتى تتمكن من حفظ السجل.

source: You are not permitted to perform this action.
ar: ليست لديك صلاحيات للقيام بهذا العمل.

source: You must add sessions.
ar: عليك إضافة جلسات.

source: You must add options.
ar: عليك إضافة خيارات حضور.

source: Save
ar: حفظ

source: The Save button will appear here in the LMS.
ar: زر الحفظ لا يظهر إلا في منصة المتعلم

source: Export results to CSV
ar: تحضير النتائج في ملف إكسل

source: Download CSV
ar: تحميل ملف إكسل

source: Learner data and results CSV will be available in the LMS.
ar: النتائج متاحة للتنزيل كملف إكسل في منصة المتعلم

source: Display Name
ar: العنوان

source: Sessions
ar: الجلسات

source: Uses a specific formatting. Check example to know the supported keys.
ar: حدد الجلسات بنفس الصيغة المستخدمة في المثال.

source: Options
ar: خيارات الحضور

source: Notes:
ar: ملاحظات

source: If you change sessions, learner records for the removed sessions will be lost. New sessions will not have any values for learners initially but will get the value of the first option after the first save subsequent to the change (unless a different options is chosen).
ar: إذا قمت بحذف جلسات، ستحذف هذه الجلسات من السجل وستحذف خيارات الحضور المرافقة لها لكل المتعلمين. إذا قمت بإضافة جلسات جديدة فلن يكون لها أي خيار حضور للمتعلمين لكن بعد أول عملية حفظ سيتم اختيار الخيار الأول من خيارات الحضور لجميع المتعلمين ما لم تحدد لهم خيارات أخرى.

source: If you change options, learner records for the removed options will be removed. After the first subsequent save, they will get the value of the first option (unless a different options is chosen).
ar: إذا قمت بتعديل خيارات الحضور وإزالة بعض الخيارات فستحذف من سجل الطلاب وستتم إضافة الخيار الأول لجميع الطلاب بعد عملية الحفظ ما لم يتم اختيار خيارات غيره.

source: Cancel
ar: إلغاء
